<template>
  <div id="Update">
    <div class="article animate__animated animate__fadeIn">
      <div class="header">
        <h1>服务外包创新创业大赛a12赛道超星集团教考分离系统作品介绍</h1>
      </div>
      <div class="article-main">
        <h2>(一）需求分析</h2>
        <h3>1、整体背景</h3>
        <ul>
          <li>
            考试是所有教学过程中的一个重要环节，是与教育同生共存的，也是检查教学质量高低和教学目标实施过程中的重要手段。而随着信息时代的不断推进，考试系统不断的革新也为新型的教学模式带来新的生命力，从疫情以来线上考试系统饱受社会和高校考验，考试系统的功能性和体验感能否满足教学的需求成为了其面临的主要难题，而考试系统能否在正常教学中发挥其效果则成了学校和学生关心的问题，创新性、高效性等信息时代的关键词则成了今后线上考试系统的方向标尺。
          </li>
          <li>
            教考分离是教育学中术语，其目的是将教学和考试分开，在实际教学和考试中，任课老师不参与所任课程的考试的一系列流程。教考分离强调严格按教学大纲教学，根据培养目标、教学目的、教学大纲，制定考核大纲，建立一套包括试题库、自动命题、阅卷、评分、考试分析、成绩管理等各种规章制度完备的考核管理系统。相对于教考合一而言，教考分离有利于教学考核的公平、公正，有利于教学评价的科学、有效，有利于教风、学风的根本好转。对于学生而言，教考分离会帮助学生认识到，考核成绩取决于对所学课程掌握与理解水平的高低，能促使其树立端正的学习态度，努力学习并掌握课程的基本内容、重点内容，经受课程学习结束后的考试检验。而对于教师而言，实行教考分离，能够使教师自觉地按照课程教学大纲和基本要求组织教学，注重教学研究，改进教学方法，求得好的教学效果。
          </li>
          <li>
            而基于教考分离的考试系统，同时满足了规范教学工作和适应教学管理制度改革的需要，以教学大纲为依据进行教学和考核，统一命题、集体流水评卷的教考分离模式，有利于充分发挥考试在教学工作中的作用，使教学工作规范有序地进行，从而最终形成重教重学的良好氛围，不断提高学校的教学质量。
          </li>
          <li>
            同样的，近些年来习近平总书记始终坚持把教育放在社会主义现代化建设中的优先发展战略地位。而教育部颁发的《关于加快建设高水平本科教育全面提高人才培养能力的意见》（新时代高教四十条）中，对于考试体系指明方向“加强考试管理，严格过程考核……以考辅教、以考促学。”教育大数据在推送教育改革与发展方面的战略地位凸显，以教育大数据采集、评价分析和应用为代表的技术体系与平台已成为推送教育改革的重要载体和前沿阵地之一。
          </li>
        </ul>
        <h3>2、模块设计</h3>
        <ul>
          <li>
            基于教考分离的考试系统是基于人工智能技术、大数据分析、云计算服务等新媒体技术开发的新一代在线考试系统。该系统基于在线教学平台构建的考试功能体系涵盖了目前各类院校的常用考试流程和功能使用需求，针对教考分离模式进行深化设计，各功能模块统筹规划且支持独立运行，并提供完备的数据安全和运维保障服务。
          </li>
          <li>
            随着线上教学系统的普遍使用，对于基于教考分离的考试系统的需求的复杂度和难度也越来越高。本系统对需要包含完整的考试流程管理功能进行相应的模块设计：建立题库、组卷、考试、监考、批阅和考试结果统计等。
          </li>
          <li>
            系统管理模块包括功能模块管理、组织机构管理、角色权限管理和操作日志管理。功能模块管理需要对考试系统功能进行多样化管理，本系统通过分别建立学生端和教师端双子系统，给教师和学生分别提供以差异化功能组件整合形成的完全体系统；组织机构管理则需要对高校、专业、班级三级单位进行梯度化管理，在每一个梯度设置相应的组织管理机制，分别在不同层级对普通用户进行高效化、有序化管理；角色权限管理则是系统中重要的安全和性能保障需求，对于不同角色的权限进行相应程度上的限制，在安全层面上能够做到有效防止越权行为的产生，并且对不同级别和身份的用户进行相应权限的赋予，能够有效优化用户操作的效率和系统信息安全的层级化防护；操作日志管理是提供给系统管理员用户所设置的日志管理方式，能够有效从后台查询相应的普通用户的操作日志并有利于管理员用户对普通用户进行系统化管理，从而达到高效管理多角色用户的优秀效果。
          </li>
          <li>
            用户管理模块包括管理员用户管理、教师用户、学生用户系统管理，管理员用户人工对相应的教师用户和学生用户进行管理，同时可以支持管理员用户模拟教师、学生角色登录已经进行一些相应功能的操作，并且在提供给管理员用户以高权限以完成一些特殊事件的处理。平台系统本身能够对教师用户和学生用户进行智能化、系统化管理，系统能够通过不同用户的特定标签来区分不同身份的用户并对相应用户群进行自动化管理，此外不同用户还有其相应的身份认证系统：人脸识别认证管理功能，支持人脸采集和照片采集的认证方式，通过利用人脸识别的高效性和准确性，对不同用户进行快速、精准的身份鉴定。
          </li>
          <li>
            题库模块实现试题分类管理、题库建设、题库个性化管理、题库安全管理和审批管理。题库需支持考试中绝大多数题型，题型包括但不限于：单选、多选、填空、判断、名词解析、论述、计算、分录、资料、连线、投票、排序、完形填空、阅读理解、综合、口语、听力、程序等多种题型，并对不同的题型施行分类管理；题库建设方式分为两种，第一种是以系统题库为主，系统根据教学大纲和课程体系智能化构建系统题库，学生用户和教师用户可以在系统题库的基础上进行更新和完善形成新的题库。同时，系统还提供给学生用户和教师用户个性化题库管理的方式。对于学生用户，系统提供错题库进行斩错训练，能够有效提高学生用户对考试错题的反思和理解，并帮助学生用户进行进一步温习和提高，对于教师用户，系统提供课程私有题库并给与教师用户管理题库的高自主权，教师用户可以对题库中试题数量、试题类型等题库数据进行个性化修改；在题库安全管理中，每个用户的题库均需要进行安全查验，有效防止个人用户题库的泄漏和丢失，系统会对题库中异常操作进行自动巡查，并按照相应预案对管理员用户和个人用户进行信息反馈；系统对个人题库更新和完善审批进行智能化管理，首先利用人工智能系统对更新和完善的题库进行智能纠错和违规内容报错，将纠错内容信息反馈给个人用户方便个人用户更高效完成更完善题库的组建，将违规内容同时反馈给系统管理员和个人用户，以便于系统管理员及时的人工审查和个人用户的自我整改。
          </li>
          <li>
            试卷管理模块提供手动组卷和智能组卷方式，手动组卷由教师用户从题库中手动选择题目，并对题目进行排序和赋予分值，最终系统根据教师用户提供的题目信息进行试卷的生成。而智能组卷则是只需要教师用户对试卷的参数进行配置，如提供相应题型比例、题目难度、题目分值等信息，系统即可自动进行组卷，同时教师用户可以选择差异化组卷，使不同学生用户接受到相同难度的试卷但是具体题目不同，从根源上防止了学生用户在线上考试中的作弊行为。同时教师用户可以对已创建的试卷进行封存、预览、编辑、复制、发布考试、删除、分配教师等管理操作，使得教师用户可以高效操作试卷，节约了教师用户对试卷操作的时间成本。
          </li>
          <li>
            考试发布管理模块教师用户可以对考试过程进行各项参数设置，包括考试发放对象用户、考试基本信息设置（考试时间、答题时长、限时进入、限时提交、考试批次、考试场次）、防作弊设置、高级设置和考试通知发放。
          </li>
          <li>
            考试管理模块可以查看未开始、进行中、已结束的所有考试，以列表形式呈现给用户。教师用户针对每次考试可以进行查看考试详情、管理考生、在线监考、管理监考老师、批阅试卷以及删除考试等操作。同时监考数据支持导出，可用于考试数据分析及存档。
          </li>
          <li>
            考务管理模块可以实现考务课程管理、考试类型管理、考试批次、排考数据管理以及未发布考试管理。管理员用户和权限较高的教师用户可以对考务课程进行管理，按照考务课程和考试类型进行分类管理，统筹学校、专业、班级三个层次的考试批次，根据系统推荐的智能化排序对排考数据进行统一化管理，并对未发布考试进行高精度算法排序，最终形成高效的考务管理过程。
          </li>
          <li>
            阅卷管理模块提供个性化阅卷设置，系统可以智能实现客观题自动批阅，主观题由阅卷老师批阅，同时支持生生互评等批阅方式，提高阅卷效率，有效减轻主观题教师用户的工作量，也满足不同形式的阅卷需求。阅卷后成绩自动记录，支持成绩导出、试卷导出、考试附件打包导出、数据存档等功能，方便考试数据分析以及试卷校对等功能。
          </li>
          <li>
            成绩管理模块支持对线上成绩和线下成绩的管理，教师端可以手动添加线下或平时成绩，而平台则对线上成绩自动进行存储，并将两部分成绩统一交付给教师用户进行管理，在减轻教师用户统计成绩的时间之时也避免了因为人工失误导致的一系列成绩管理问题。
          </li>
          <li>
            统计分析模块，对考试系统运行的整体情况进行综合分析，通过提供给老师班级整体数据、各题型得分情况、各考试范围内容得分情况等多维化数据，让教师用户能够更加清晰和直观的掌握考试相关数据，有利于教师用户根据考试结果对教学进行相应的改进和对考试内容以及难度的有机调整。同时系统还对学生用户的考试试卷进行分析，对比班级和自身试卷结果在题型、考试范围等多角度进行智能分析并提供个人化学习和调整建议。
          </li>
        </ul>
        <h2>（二）作品优势</h2>
        本项目所开发的教考分离系统是基于人工智能技术、大数据分析、云计算服务等新媒体技术开发的新一代在线考试系统。本系统基于在线教学平台构建的考试功能体系涵盖了目前各类院校的常用考试流程和功能使用需求，针对教考分离模式进行深化设计，各功能模块统筹规划且支持独立运行，并提供完备的数据安全和运维保障服务。
        <h3>1、人工智能技术</h3>
        <ul>
          <li>
            人脸识别是近年来模式识别、图像处理、机器视觉、神经网络以及认知科学等领域研究的热点课题之一，被广泛应用于公共安全（罪犯识别等）、安全验证系统、信用卡验证、医学、档案管理、视频会议、人机交互系统等各个方面。
          </li>
          <li>
            而本系统利用人脸识别技术，简化了线上考试身份认证的流程，通过人工智能技术同时节约了教师用户和学生用户的认证时间，同时通过不定期抓拍检测节约了教师用户的监考成本。同时该技术的可靠性也能够保证防作弊效果的有效实施，基于已经经过开源市场检验的成熟人脸识别技术，能够有效的防止线上考试的作弊行为。
          </li>
        </ul>
        <h3>2、大数据分析</h3>
        <ul>
          <li>
            大数据分析工具对于公司和企业非常重要，互联网时代生成和管理数据非常庞大。大数据分析工具可以帮助企业节省时间和经济，并帮助获取洞察力，为数据驱动的决策提供信息。有各种类型的工具可能属于大数据分析的范畴，或用于改进数据分析过程：数据存储和管理，数据清理，数据挖掘，数据分析，数据可视化，数据集成和数据收集。通过高性能数据挖掘、预测分析、文本挖掘、预测和优化，利用大数据分析的企业能够推动创新并做出最佳业务决策。利用大数据分析解决方案所提供的所有优势的公司可以更好地优化机器学习并以突破性的方式满足其大数据需求。
          </li>
          <li>
            而本系统利用大数据技术，通过对题库的整合和随机化处理，能够极大的帮助教师用户节约时间成本，同时通过高性能的数据收集、数据集成和组卷可视化，能够有效帮助教师用户进行合理化出卷，并且在通过大数据重组的试卷可以达到差异化分发的效果，同时也遏制了线上考试作弊的可能性。
          </li>
        </ul>
        <h3>3、云平台服务</h3>
        <ul>
          <li>
            本项目最终采用云计算服务进行部署，不再依赖某一台特定的计算机来访问及处理自己的数据。个人用户只需要可以连上互联网，就能检索自己的文件、继续处理未完成的工作，减少了在用户学习场所、教室与住所之间频繁的复制和备份自己正在处理或已经处理的文件和相关工作资料，在任何地方只需将文件及相关工作资料放在云端，不依赖于特定计算机就能同步和共享所有数据，无论个人计算机出现什么状况，其处理的数据始终存放在云中，也非常符合现代移动办公等业务需要。
          </li>
          <li>
            为教师团队协作共享带来便利，文件远程存储便于协作工作和共享。云计算数据共享，以网络为媒介提供和传送信息与服务，为用户团队通过网络协作带来便利。如通过共享题库系统来轻松、安全进行项目协作。
          </li>
          <li>
            用户本地不再需要购买大量的本地存储空间和硬件设备。云端提供无容量限制存储服务，运行应用程序的许多繁重工作将通过网络来处理，数据和文件均在云端，本地计算机会变得更小巧、更轻便，可以简化为一个带云系统的浏览器，即本地磁盘等存储设备存储空间就不再重要了，降低了计算机设备总体拥有成本.
          </li>
          <li>
            用户不用维护自己的应用程序或文件，用户端负载降低。云用户的所有数据存储在云端，程序运行在云端，用户不需要自己考虑文件的安全性，云服务商有专业的团队在维护和管理，能确保云端的数据或程序安全可靠，达到应用程序的开发与基础设施维护相对分离，同时降低了用户端的负载。
          </li>
        </ul>
        <h3>4、项目其他特点</h3>
        <div class="table-wrap">
          <table>
            <tbody>
              <tr>
                <td>组卷科学性</td>
                <td>
                  依据考核内容的难度及对知识点掌握要求将试题划分为不同分值，并根据教学大纲和培养计划制定组卷策略。考试时系统可随时依据组卷策略从题库中随机抽取试题进行自动组卷，自动生成考生个人试卷。
                </td>
              </tr>
              <tr>
                <td>判卷准确性</td>
                <td>
                  客观题系统自动评分，主观题评分采用教师用户和学生互评两种方式进行评分，并且系统在阅卷评分后增加了审核步骤，只有经过审核的评分，考试系统才会将其作为考生的得分进行确认，以便与客观题得分进行累计汇总，使评阅误差得到有效控制。
                </td>
              </tr>
              <tr>
                <td>考试安全性</td>
                <td>
                  采用随机组卷的科学模式，使得每个考生的试题都不相同，对于要求试卷内容一致的考试，还可以打乱试题及选项的顺序，让考生无法互相抄袭，最终起到有效检验学生学习成果的效果。
                </td>
              </tr>
              <tr>
                <td>环境灵活性</td>
                <td>
                  考生的考试地点比较灵活，避免考生因为环境矛盾存在的问题影响考试。同时，在考试管理、资源调配等方面也比较机动灵活，大大降低了考试对场所的硬件要求，同时也能更好地满足考生灵活多样的个别化考试服务要求。
                </td>
              </tr>
              <tr>
                <td>分析精确性</td>
                <td>
                  提供强大的报表分析功能，为教学效果评价提供科学的依据和及时准确的反馈。此外，还可以将所有参加线上考试考生的答题信息和教师阅卷信息悉数存储起来，以便查询和存档，这大大节约了人力、物力和财力。
                </td>
              </tr>
            </tbody>
          </table>
        </div>
        <h3>5、项目特点总结</h3>
        本基于教考分离的考试系统满足了检验线上教学成果的功能，可以更方便的组织考试，整个考试流程完全由系统辅助或者自动完成，因而避免了人为因素的疏忽而造成的失误，也极大地提高了组卷效率和考试效果，较大的节约了教师和学生的时间和空间成本，快速检测学生的学习效果，巩固教学知识，本基于教考分离的考试系统可以极大地提高考试的灵活性、公正性、可信度和工作效率。随着计算机技术的发展、分布式计算能力的提高，基于教考分离的考试系统是未来发展的必然趋势。
        <h2>（三）、未来展望</h2>
        <ul>
          <li>
            由于时间和成本上的限制，本平台对基于教考分离系统的功能完成有限，以下是本团队对项目进行未来的设计和展望。
          </li>
          <li>
            在下一代版本中的教考分离系统中，我们计划对系统功能进行进一步丰富。
            在题库管理系统中，下一代版本系统题库要支持无限层级创建题库分类，支持对试题进行批量修改、删除、导出等操作，支持按照题型、难易度、创建时间、关键词输入对题库中的试题进行筛选搜索；支持使用Word、Excel、TXT模板批量导入试题，支持可视化批量新增试题。
          </li>
          <li>
            在用户和考试管理系统中，下一代版本系统要支持自主添加考生信息或使用Excel模板批量导入考生信息，支持不限层级创建组织架构；支持多种安排考试的方式，有免登录、口令、免登录+口令、账号密码这四种考试授权方式；考生可以通过二维码、链接、以及微信小程序进入考生中心，查看自己被安排的考试，以及自己参加过的所有考试记录及成绩。
          </li>
          <li>
            在考试管理系统中，除支持创建正式的线上考试外，平台还具有模拟考试+练习考试+正式考试多种组合考试模式。满足各类型线上刷题需求。模拟考试还原正式考试场景，帮助考生锻炼自己的答题节奏，更好的掌握考场状态。练习模式具有顺序练习及随机练习两种模式，顺序练习将按照原出题顺序逐题练习，而随机练习模式将打破原有顺序灵活出题，帮助考生更加真实的检测知识点掌握情况。
          </li>
          <li>
            此外，下一代版本中考试系统支持多终端答题，可支持电脑PC端、手机移动端、微信公众号等平台答题，在教师用户发放试题后，系统自动生成链接和二维码，用户提供分享链接或二维码到微信、微信公众号、微博、QQ等，让考生可以更方便的扫码答题。
          </li>
        </ul>
        <h2>（四）、特别鸣谢</h2>
        <ul>
          <li>
            四个月的开发时光匆匆结束，尽管项目作品本身还有许多不足之处，但是他凝聚了我们小组成员郎文翀、潘祎哲、杨国涛、黄硕、吴海涛5个人的汗水与努力！回首立项之初，我们还在为难以完成的预期目标而感到畏手畏脚、而如今4个月的开发经历，我们不仅仅收获了一个较为满意的成品结果，同时在开发过程中我们对软件的开发流程有了进一步的了解，并且从中学习了许多先进的开发技术以及宝贵的经验，更重要的是通过本次备赛，我们拥有了面对挑战的信心、勇气以及通过沟通合作解决问题的能力！再次为团队中的每一为开发成员表示衷心的感谢！
          </li>
          <li>
            同时本项目是在王赞老师的精心指导和大力支持下完成的，他渊博的学识和开阔的视野给了我们团队很多深刻的启发和建议、在此我们由衷的感谢王赞老师对本项目的辛勤付出。
          </li>
          <li>
            最后，还要感谢服务外包创新创业大赛和超星集团为我们提供的展现自我、挑战自我、提升自我的比赛平台，我们相信通过本次比赛不仅仅是收获一纸证书，更是一份人生中不可多得的美好大学回忆！
          </li>
        </ul>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "about",
};
</script>

<style scoped>
#Update {
  width: 100%;
  min-height: 300px;
  overflow-y: scroll;
  overflow-x: hidden;
}
#Update::-webkit-scrollbar {
  width: 0px;
}
h1 {
  font-family: "SentyGoldenBell";
  color: rgba(87, 76, 76, 0.94);
}
h2,
h3 {
  font-family: "hytmr";
}
.article {
  position: relative;
  margin-top: 10px;
  width: 100%;
  min-height: 300px;
  background: #fff;
  border: 1px solid #d1d1d1;
  transition: 1s;
}
.article::before {
  content: "";
  position: absolute;
  left: -2px;
  top: 0px;
  width: 5px;
  height: 80px;
  background: #4d4d4d;
}
.article .header {
  display: flex;
  justify-content: space-between;
  padding: 30px 60px 0px 25px;
  padding-left: 7.6923%;
  align-items: center;
}
.article .header h2 {
  margin: 0px;
  color: #696969;
  margin-left: 0;
  font-weight: 400;
  line-height: 35px;
  font-size: 26px;
}
.article .header .time img {
  height: 20px;
  margin-right: 8px;
}
.article .header .time {
  display: flex;
  align-items: center;
  height: 100%;
}
.article .header .time p {
  margin: 0px;
  letter-spacing: 2px;
  color: #999;
}
.article .article-main {
  box-sizing: border-box;
  padding-right: 7.6923%;
  padding-left: 7.6923%;
}
.article .article-main p {
  text-align: justify;
  box-sizing: border-box;
  color: #1a1a1a;
  font-family: lucida grande, lucida sans unicode, lucida, helvetica,
    Hiragino Sans GB, Microsoft YaHei, WenQuanYi Micro Hei, sans-serif;
  font-size: 1rem;
  line-height: 1.8em;
  transition: 1s;
}
.article .article-main h1,
.article .article-main h2,
.article .article-main h3,
.article .article-main h4,
.article .article-main h5 {
  margin-top: 20px;
  font-weight: 700;
  color: #574c4c;
  padding-bottom: 5px;
  border-bottom: 1px solid #ddd;
  text-transform: capitalize;
  box-sizing: border-box;
}
.article .article-main a {
  text-decoration: none;
  color: #08c;
}
.table-wrap {
  margin: 0 0 1rem;
}
.table-wrap table {
  color: #1a1a1a;
  font-family: lucida grande, lucida sans unicode, lucida, helvetica,
    Hiragino Sans GB, Microsoft YaHei, WenQuanYi Micro Hei, sans-serif;
  font-size: 1rem;
  border-color: grey;
  overflow-wrap: break-word;
  display: table;
  width: 100%;
  border-spacing: 0;
  border-collapse: collapse;
  empty-cells: show;
}
.table-wrap table thead {
  background: rgba(153, 169, 191, 0.1);
  vertical-align: center;
}
.table-wrap table tr {
  box-sizing: border-box;
}
.table-wrap table td {
  display: table-cell;
}
.table-wrap table th,
.table-wrap table td {
  display: table-cell;
  padding: 0.3rem 0.6rem;
  border: 1px solid #d6d6d6;
  vertical-align: middle;
}
.article .article-main pre {
  font-family: consolas, Menlo, "PingFang SC", "Microsoft YaHei", sans-serif;
  overflow-x: auto;
  font-size: 16px;
  font-weight: 700;
  line-height: 1.5;
}
.hljs {
  border-radius: 8px !important;
}
.article .article-footer {
  padding-top: 20px;
  margin: 30px 7.6923% 0;
  height: 80px;
  border-top: 1px solid #ddd;
  box-sizing: border-box;
  position: relative;
}
.article .article-main ul {
  border-left: 1px solid #ddd;
  margin-bottom: 30px;
}
.article .article-main li {
  margin: 10px;
  color: #1a1a1a;
}
@media screen and (max-width: 800px) {
  #Introduction {
    max-height: initial;
    overflow: visible;
  }
}
@media screen and (max-width: 499px) {
  .article .article-main {
    padding-right: 3%;
    padding-left: 3%;
  }
  .article .article-main pre {
    font-size: 10px;
  }
}
</style>